#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
aws_ecr_repository.task_listing_app: Refreshing state... [id=task-listing-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elastic_beanstalk_application.task_listing_app will be created
  + resource "aws_elastic_beanstalk_application" "task_listing_app" {
      + arn         = (known after apply)
      + description = "Task listing application"
      + id          = (known after apply)
      + name        = "patsy-task-listing-app"
      + tags_all    = (known after apply)
    }

  # aws_elastic_beanstalk_environment.task_listing_app_environment will be created
  + resource "aws_elastic_beanstalk_environment" "task_listing_app_environment" {
      + all_settings           = (known after apply)
      + application            = "patsy-task-listing-app"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "patsy-task-listing-app-env"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2023 v4.0.1 running Docker"
      + tags_all               = (known after apply)
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "Application Healthcheck URL"
          + namespace = "aws:elasticbeanstalk:application"
          + value     = "/"
            # (1 unchanged attribute hidden)
        }
      + setting {
          + name      = "DeploymentPolicy"
          + namespace = "aws:elasticbeanstalk:command"
          + value     = "AllAtOnce"
            # (1 unchanged attribute hidden)
        }
      + setting {
          + name      = "EC2KeyName"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "patsy-new-key-ec2-task"
            # (1 unchanged attribute hidden)
        }
      + setting {
          + name      = "EnvironmentType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "SingleInstance"
            # (1 unchanged attribute hidden)
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "elastic-beanstalk-ec2-instance-profile"
            # (1 unchanged attribute hidden)
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "t2.micro"
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_instance_profile.elastic_beanstalk_ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "elastic_beanstalk_ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "elastic-beanstalk-ec2-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "elastic-beanstalk-ec2-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.elastic_beanstalk_ec2_role will be created
  + resource "aws_iam_role" "elastic_beanstalk_ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "elastic-beanstalk-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.eb_ecr_access will be created
  + resource "aws_iam_role_policy_attachment" "eb_ecr_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonECR-FullAccess"
      + role       = "elastic-beanstalk-ec2-role"
    }

  # aws_iam_role_policy_attachment.eb_web_tier will be created
  + resource "aws_iam_role_policy_attachment" "eb_web_tier" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"
      + role       = "elastic-beanstalk-ec2-role"
    }

  # aws_iam_role_policy_attachment.eb_worker_tier will be created
  + resource "aws_iam_role_policy_attachment" "eb_worker_tier" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier"
      + role       = "elastic-beanstalk-ec2-role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + elastic_beanstalk_environment_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>